/*
 * Click nbfs://nbhost/SystemFileSystem/Templates/Licenses/license-default.txt to change this license
 * Click nbfs://nbhost/SystemFileSystem/Templates/Classes/Class.java to edit this template
 */
package com.kov.javalessons;

/**
 *
 * @author olegk
 */
public class Data {
    public static String[] categoryData = {"Название категории", "URL категории", "id родительской категории", "URL родительской категории", "Описание категории", "Изображение", "Заголовок [SEO]", "Ключевые слова [SEO]", "Описание [SEO]", "SEO Описание", "Наценка", "Не выводить в меню", "Активность", "Не выгружать в YML", "Сортировка", "Внешний идентификатор", "id"};
    public static String[] categoryData1 = {
            "Verto", 
            "verto", 
            "7", 
            "mezhkomnatnye-dveri-vinnica/", 
            "<div class='textwidget'><center><h3>О ФИРМЕ</h3></center>ООО Фабрика Дверей 'БудМайстер', один из крупнейших производителей межкомнатных дверей на территории Украины. Предприятие более 20 лет работает на рынке строительных столярных изделий, выпуская широкий ассортимент продукции под Торговой Маркой Verto. На сегодняшний день продукция Фабрики Дверей завоевала доверие покупателей на рынке межкомнатных дверей высоким качеством, современным дизайном и отличным соотношением цены – качества предлагаемой продукции.Фабрика Дверей входит в инвестиционно-производственную группу предприятий 'БудМайстер', что создает стабильную финансовую инфраструктуру Фабрики и гарантирует активное и динамичное развитие ТМ Verto на территории всей Украины и за ее пределами.</div><div class='textwidget'><center><h3>ПРОДУКЦИЯ</h3></center>Фабрика Дверей предлагает более 200 моделей межкомнатных дверей в пяти разных покрытиях с большим ассортиментом цветовой гаммы. Все модели дверей предлагаются в одностворчатом и двустворчатом исполнении, и могут быть изготовлены в нестандартных размерах.Помимо дверных полотен, Фабрика изготавливает дверные коробки, пороги, доборные планки и прочие аксессуары к дверным полотнам, обеспечивая покупателя необходимым ассортиментом при выборе продукции.Фабрика постоянно увеличивает объем производства, обновляя модельный ряд выпускаемой продукции, что делает ТМ Verto одну из наиболее прогрессирующих торговых марок в стране.</div><div class='textwidget'><h3 style='text-align: center'><span style='color: #ffffff'>КАЧЕСТВО</span></h3><p><span style='color: #ffffff'>Производство дверей базируется на применении зарубежных технологий. Автоматизированный процесс позволяет высококлассным специалистам контролировать качественные характеристики продукции на каждой стадии изготовления: от подбора материалов до получения продукции покупателем. Подтверждением этому факту является сертификат качества ISO 9001.</span><br><span style='color: #ffffff'>Продукция Фабрики дверей соответствует необходимым строительным требованиям, что подтверждается наличием сертификатов.</span></p></div><div class='panel-grid-cell' id='pgc-171-3-0'><div class='so-panel widget widget_black-studio-tinymce widget_black_studio_tinymce panel-first-child panel-last-child' id='panel-171-3-0-0' data-index='5'><div class='textwidget'><h3 style='text-align: center'>ДИСТРИБУЦИЯ</h3><p>Реализация продукции ТМ Verto осуществляется через дилерскую сеть из более 400 дилеров по территории всей Украины. Вся продукция представлена в выставочных салонах и магазинах, соответствующих требованиям ТМ Verto.<br>Фабрика Дверей постоянно развивает дилерскую сеть на территории Украины и за её приделами , а также сотрудничает с крупнейшими строительными и торговыми организациями. Благодаря активной работы дилеров с Авторизованными Магазинами, продукция ТМ Verto доступна на всей территории Украины.</p></div></div></div>", 
            "/uploads/verto.png", 
            "Купить межкомнатные двери Verto в Виннице", 
            "Межкомнатные двери Verto Винница, Verto двери в Виннице, Где купить Verto межкомнатные двери в Виннице, Магазины Verto дверей Винница, Verto двери цены Винница, Межкомнатные двери Verto Винницкая область, Verto двери продажа Винница, Двери Verto каталог Винница, Verto межкомнатные двери акции Винница, Verto двери отзывы Винница", 
            "<p><strong>Межкомнатные двери Verto</strong> - это превосходное сочетание стиля, качества и функциональности для вашего интерьера. В нашем ассортименте представлены двери, которые выделяются элегантным дизайном, разнообразием отделок и надежной конструкцией.</p><p>Независимо от ваших предпочтений, вы сможете найти идеальную дверь <strong>Verto</strong>, которая подходит к вашему интерьеру. Благодаря использованию высококачествных материалов и инновационных технологий, двери Verto обеспечивают долговечность, звукоизоляцию и защиту от влаги.</p><p>Выбирая <strong>Verto</strong>, вы инвестируете в комфорт и стиль вашего дома. Наши двери не только функциональны, но и придают вашему интерьеру утонченный вид. Переходите к <strong>Verto</strong> для того, чтобы создать идеальный дом.</p>", 
            "<p><strong>Межкомнатные двери Verto</strong> - это превосходное сочетание стиля, качества и функциональности для вашего интерьера. В нашем ассортименте представлены двери, которые выделяются элегантным дизайном, разнообразием отделок и надежной конструкцией.</p><p>Независимо от ваших предпочтений, вы сможете найти идеальную дверь <strong>Verto</strong>, которая подходит к вашему интерьеру. Благодаря использованию высококачествных материалов и инновационных технологий, двери Verto обеспечивают долговечность, звукоизоляцию и защиту от влаги.</p><p>Выбирая <strong>Verto</strong>, вы инвестируете в комфорт и стиль вашего дома. Наши двери не только функциональны, но и придают вашему интерьеру утонченный вид. Переходите к <strong>Verto</strong> для того, чтобы создать идеальный дом.</p>", 
            "0", 
            "0", 
            "1", 
            "1", 
            "1241", 
            "", 
            "1241"
        };

    /**
     *
     */
    public static String[] newCategoryData = {
        "НСД Двери", 
        "nds-dveri", 
        "1241", 
        "verto/", 
        "Межкомнатные двери Verto Винница, Verto двери в Виннице, Где купить Verto межкомнатные двери в Виннице, Магазины Verto дверей Винница, Verto двери цены Винница, Межкомнатные двери Verto Винницкая область, Verto двери продажа Винница, Двери Verto каталог Винница, Verto межкомнатные двери акции Винница, Verto двери отзывы Винница",
        "/uploads/verto.png", 
        "Купить шпонированные двери Verto в Виннице", 
        "Verto Двери, двери с четвертью, купить двери Verto в Виннице", 
        "Вы можете купить межкомнатные двери Verto в Виннице по доступным ценам магазин DOOR IN ул. Замостянская 25.",
        "Межкомнатные двери Verto Винница, Verto двери в Виннице, Где купить Verto межкомнатные двери в Виннице, Магазины Verto дверей Винница, Verto двери цены Винница, Межкомнатные двери Verto Винницкая область, Verto двери продажа Винница, Двери Verto каталог Винница, Verto межкомнатные двери акции Винница, Verto двери отзывы Винница",
        "1,5",
        "0",
        "1",
        "1",
        "1241",
        "",
        "1241"
    };
    public static String[] productsData = {
        "Категория",
        "URL категории",
        "Товар",
        "Вариант",
        "Описание",
        "Цена",
        "URL",
        "Изображение",
        "Артикул",
        "Количество",
        "Активность",
        "Заголовок [SEO]",
        "Ключевые слова [SEO]",
        "Описание [SEO]",
        "Старая цена",
        "Рекомендуемый",
        "Новый",
        "Сортировка",
        "Вес",
        "Связанные артикулы",
        "Смежные категории",
        "Ссылка на товар",
        "Валюта",
        "Свойства",
        "id"
    };
    
    public static String[] productsData1 = {
        "Межкомнатные двери/Verto/Классик",
        "mezhkomnatnye-dveri-vinnica/verto/klassik",
        "Дверне полотно 1.0",
        "",
        "<div class=\"summary entry-summary\">\n" +
                "\n" +
                "\t\t<h1 itemprop=\"name\" class=\"product_title entry-title\">1.0</h1><div itemprop=\"offers\" itemscope=\"\" itemtype=\"http://schema.org/Offer\">\n" +
                "\n" +
                "\t<p class=\"price\"></p>\n" +
                "\n" +
                "\t<meta itemprop=\"price\" content=\"0\">\n" +
                "\t<meta itemprop=\"priceCurrency\" content=\"UAH\">\n" +
                "\t<link itemprop=\"availability\" href=\"http://schema.org/InStock\">\n" +
                "\n" +
                "</div>\n" +
                "<div itemprop=\"description\">\n" +
                "\t<p><strong><span style=\"vertical-align: inherit;\"><span style=\"vertical-align: inherit;\">КОНСТРУКЦИЯ ПОЛОТНА</span></span></strong></p>\n" +
                "<ul>\n" +
                "<li><span style=\"vertical-align: inherit;\"><span style=\"vertical-align: inherit;\">Каркас рамы полотна изготовлен из соснового бруса, срощенного по длине микрошипом.</span></span></li>\n" +
                "<li><span style=\"vertical-align: inherit;\"><span style=\"vertical-align: inherit;\">Заполнение холста: стабилизирующий сотовый наполнитель или трубчатое ДСП заполнение.</span></span></li>\n" +
                "<li><span style=\"vertical-align: inherit;\"><span style=\"vertical-align: inherit;\">Рама вместе с наполнителем оклеена с двух сторон плитами ХДФ.</span></span></li>\n" +
                "<li><span style=\"vertical-align: inherit;\"><span style=\"vertical-align: inherit;\">Оба торца холста и верх оклеены кромочной лентой под цвет холста.</span></span></li>\n" +
                "</ul>\n" +
                "<p><strong><span style=\"vertical-align: inherit;\"><span style=\"vertical-align: inherit;\">ПОКРЫТИЕ</span></span></strong></p>\n" +
                "<ul>\n" +
                "<li><span style=\"vertical-align: inherit;\"><span style=\"vertical-align: inherit;\">Дверное полотно оклеено покрытием “SIMPLEX”, “Verto-CELL”, “UNI-MAT” или “RESIST”.</span></span></li>\n" +
                "<li><span style=\"vertical-align: inherit;\"><span style=\"vertical-align: inherit;\">Рамка по периметру остекления (МДФ) оклеена под цвет холста.</span></span></li>\n" +
                "</ul>\n" +
                "<p><strong><span style=\"vertical-align: inherit;\"><span style=\"vertical-align: inherit;\">МОДЕЛЬ</span></span></strong></p>\n" +
                "<ul>\n" +
                "<li><span style=\"vertical-align: inherit;\"><span style=\"vertical-align: inherit;\">Одностворчатые и двустворчатые во всех моделях.</span></span></li>\n" +
                "<li><span style=\"vertical-align: inherit;\"><span style=\"vertical-align: inherit;\">Все модели могут быть выполнены под раздвижную систему – без фурнитуры и четверти, нижний торец фрезирован под направляющий элемент, крепящийся к полу.</span></span></li>\n" +
                "</ul>\n" +
                "</div>\n" +
                "<div class=\"product_meta\">\n" +
                "\n" +
                "\t\n" +
                "\t\n" +
                "\t<span class=\"posted_in\">Категории: <a href=\"https://verto-doors.com/ru/product-category/doors/%d0%ba%d0%bb%d0%b0%d1%81%d1%81%d0%b8%d0%ba/\" rel=\"tag\">Классик</a>, <a href=\"https://verto-doors.com/ru/product-category/doors/\" rel=\"tag\">Межкомнатные двери</a></span>\n" +
                "\t\n" +
                "\t\n" +
                "</div>\n" +
                "\n" +
                "\n" +
                "\t</div>",
        "0",
        "dverne-polotno-1-0",
        "1.0-2-306x350.jpg[:param:][alt=Дверне полотно 1.0][title=Дверне полотно 1.0]",
        "",
        "-1",
        "1",
        "Межкомнатные двери Verto Классик Дверне полотно 1.0",
        "Межкомнатные двери Verto Классик 1.0 купить, Межкомнатные, двери, Verto, Классик, Купить в Виннице межкомнатные двери",
        "Купить в Виннице межкомнатные двери изготовитель Verto колекция Классик модель 1.0",
        "",
        "0",
        "0",
        "3845",
        "15",
        "",
        "",
        "",
        "UAH",
        "",
        "3845"
    };
}
